In [91]:
import pandas as pd

In [92]:
df=pd.read_csv('data.csv')

In [93]:
df.head()

   3  FINE GOLD (9999): 110000  STANDARD GOLD (9950): 109500  Silver: 1450
0  4  FINE GOLD (9999): 110000  STANDARD GOLD (9950): 109500  Silver: 1450
1  5  FINE GOLD (9999): 110000  STANDARD GOLD (9950): 109500  Silver: 1435
2  6  FINE GOLD (9999): 110300  STANDARD GOLD (9950): 109750  Silver: 1445
3  7  FINE GOLD (9999): 109800  STANDARD GOLD (9950): 109300  Silver: 1445
4  8  FINE GOLD (9999): 110200  STANDARD GOLD (9950): 109650  Silver: 1445

In [94]:
df.columns

Index(['3', 'FINE GOLD (9999): 110000', 'STANDARD GOLD (9950): 109500',
       'Silver: 1450'],
      dtype='object')

In [95]:
df.head()

   3  FINE GOLD (9999): 110000  STANDARD GOLD (9950): 109500  Silver: 1450
0  4  FINE GOLD (9999): 110000  STANDARD GOLD (9950): 109500  Silver: 1450
1  5  FINE GOLD (9999): 110000  STANDARD GOLD (9950): 109500  Silver: 1435
2  6  FINE GOLD (9999): 110300  STANDARD GOLD (9950): 109750  Silver: 1445
3  7  FINE GOLD (9999): 109800  STANDARD GOLD (9950): 109300  Silver: 1445
4  8  FINE GOLD (9999): 110200  STANDARD GOLD (9950): 109650  Silver: 1445

In [96]:
df=df.rename(columns={'3':'Day','FINE GOLD (9999): 110000':'Fine Gold',
                      'STANDARD GOLD (9950): 109500':'Standard Gold','Silver: 1450':'Silver'})

In [97]:
df.head()

   Day                 Fine Gold                 Standard Gold        Silver
0    4  FINE GOLD (9999): 110000  STANDARD GOLD (9950): 109500  Silver: 1450
1    5  FINE GOLD (9999): 110000  STANDARD GOLD (9950): 109500  Silver: 1435
2    6  FINE GOLD (9999): 110300  STANDARD GOLD (9950): 109750  Silver: 1445
3    7  FINE GOLD (9999): 109800  STANDARD GOLD (9950): 109300  Silver: 1445
4    8  FINE GOLD (9999): 110200  STANDARD GOLD (9950): 109650  Silver: 1445

In [98]:
df['Day'] = df.index + 1

In [99]:
df

     Day                 Fine Gold                 Standard Gold        Silver
0      1  FINE GOLD (9999): 110000  STANDARD GOLD (9950): 109500  Silver: 1450
1      2  FINE GOLD (9999): 110000  STANDARD GOLD (9950): 109500  Silver: 1435
2      3  FINE GOLD (9999): 110300  STANDARD GOLD (9950): 109750  Silver: 1445
3      4  FINE GOLD (9999): 109800  STANDARD GOLD (9950): 109300  Silver: 1445
4      5  FINE GOLD (9999): 110200  STANDARD GOLD (9950): 109650  Silver: 1445
..   ...                       ...                           ...           ...
298  299  FINE GOLD (9999): 136200  STANDARD GOLD (9950): 135550  Silver: 1685
299  300  FINE GOLD (9999): 136300  STANDARD GOLD (9950): 135650  Silver: 1685
300  301  FINE GOLD (9999): 136800  STANDARD GOLD (9950): 136150  Silver: 1700
301  302  FINE GOLD (9999): 136600  STANDARD GOLD (9950): 135950  Silver: 1700
302  303  FINE GOLD (9999): 139000  STANDARD GOLD (9950): 138350  Silver: 1750

[303 rows x 4 columns]

In [100]:
df['Fine Gold']=df['Fine Gold'].str.replace('FINE GOLD \(9999\): ', '', regex=True)
df['Standard Gold']=df['Standard Gold'].str.replace('STANDARD GOLD \(9950\): ', '', regex=True)
df['Silver']=df['Silver'].str.replace('Silver: ', '', regex=True)

In [101]:
df

     Day Fine Gold Standard Gold Silver
0      1    110000        109500   1450
1      2    110000        109500   1435
2      3    110300        109750   1445
3      4    109800        109300   1445
4      5    110200        109650   1445
..   ...       ...           ...    ...
298  299    136200        135550   1685
299  300    136300        135650   1685
300  301    136800        136150   1700
301  302    136600        135950   1700
302  303    139000        138350   1750

[303 rows x 4 columns]

In [102]:
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score

In [103]:
x=df[['Day']]
y=df['Fine Gold']

In [104]:
X_train, X_test, y_train, y_test = train_test_split(x, y, test_size=0.2, random_state=0)
model=LinearRegression()
model.fit(X_train,y_train)
y_pred=model.predict(X_test)
accuracy_score= model.score(X_test,y_test)
print(accuracy_score)

0.6613589222757326

In [105]:
y_pred=model.predict([[304]])
y_pred

/Users/bibekrai/tensorflow-test/env/lib/python3.10/site-packages/sklearn/base.py:409: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([124511.34936914])